Autodesk.Navisworks.Api.Plugins.ExecuteDisabledException
The exception that is thrown when you try to call Execute on a plugin who's CanExecute method states that it should be disabled.

Autodesk.Navisworks.Api.Plugins.ExecuteDisabledException.#ctor
Creates a PluginLoadException

Autodesk.Navisworks.Api.Plugins.ExecuteDisabledException.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Creates a PluginLoadException

Autodesk.Navisworks.Api.Plugins.ExecuteDisabledException.#ctor(System.String)
Creates a PluginLoadException
message: The error message that explains the reason for the exception.

Autodesk.Navisworks.Api.Plugins.ExecuteDisabledException.#ctor(System.String,System.Exception)
Creates a PluginLoadException
message: The error message that explains the reason for the exception.
innerException: The exception that is the cause of the current exception. If the innerException parameter is not null, the current exception is raised in a catch block that handles the inner exception.